# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Jakob\Documents\School Work\2 - SIUE\2022-23 - Sophomore Year\Spring Semester\ECE 381\Final Lab\CAN BUS\CAN_BUS\CAN_BUS.cydsn\CAN_BUS.cyprj
# Date: Thu, 27 Apr 2023 21:48:33 GMT
#set_units -time ns
create_clock -name {CyRouted1} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyWCO} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/wco}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {Clock} -source [get_pins {ClockBlock/hfclk}] -edges {1 48001 96001} [list [get_pins {ClockBlock/udb_div_0}]]


# Component constraints for C:\Users\Jakob\Documents\School Work\2 - SIUE\2022-23 - Sophomore Year\Spring Semester\ECE 381\Final Lab\CAN BUS\CAN_BUS\CAN_BUS.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Jakob\Documents\School Work\2 - SIUE\2022-23 - Sophomore Year\Spring Semester\ECE 381\Final Lab\CAN BUS\CAN_BUS\CAN_BUS.cydsn\CAN_BUS.cyprj
# Date: Thu, 27 Apr 2023 21:48:30 GMT
